import { FinancialData } from './dataTypes';

// These are sample data files based on the data provided
export const mockData: { data: FinancialData; date: string }[] = [
  {
    date: '2025-01-01',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 89675.75,
            "人民币理财": 30112.46,
            "存款": 13693.4,
            "基金": 10033.66
          },
          "total": 143515.27
        },
      "招商银行": {
          "detail": {
            "美元理财": 22212.76,
            "人民币理财": 40287.22,
            "养老金": 12002.79
          },
          "total": 74502.77
        },
      "支付宝": {
          "detail": {
            "存款": 0,
            "基金": 14947,
            "养老金": 0
          },
          "total": 14947
        },
      "京东金融": {
          "detail": {
            "基金": 10060
          },
          "total": 10060
        },
      "腾讯自选股": {
          "detail": {
            "股票": 450
          },
          "total": 450
        },
      "grand_total": 243475.04
    }
  },
  {
    date: '2025-02-01',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 89699.21,
            "人民币理财": 75107.54,
            "存款": 4683.41,
            "基金": 10044.59
          },
          "total": 179534.75
        },
      "招商银行": {
          "detail": {
            "美元理财": 22142.9,
            "人民币理财": 20167.04,
            "养老金": 12002.79
          },
          "total": 54312.73
        },
      "支付宝": {
          "detail": {
            "存款": 0,
            "基金": 10251,
            "养老金": 0
          },
          "total": 10251
        },
      "京东金融": {
          "detail": {
            "基金": 10065
          },
          "total": 10065
        },
      "腾讯自选股": {
          "detail": {
            "股票": 1
          },
          "total": 1
        },
      "grand_total": 254164.48
    }
  },
  {
    date: '2025-03-01',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 90092.81,
            "人民币理财": 60052.96,
            "存款": 7503.66,
            "基金": 15059.13
          },
          "total": 172708.56
        },
      "招商银行": {
          "detail": {
            "美元理财": 22286.38,
            "人民币理财": 20176.75,
            "养老金": 12002.79
          },
          "total": 54465.92
        },
      "支付宝": {
          "detail": {
            "存款": 0,
            "基金": 10080,
            "养老金": 0
          },
          "total": 10080
        },
      "腾讯自选股": {
          "detail": {
            "股票": 30160.53
          },
          "total": 30160.53
        },
      "grand_total": 267415.01
    }
  },
  {
    date: '2025-04-01',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 90126.39,
            "人民币理财": 60135.64,
            "存款": 1034.32,
            "基金": 15080.63
          },
          "total": 166376.98
        },
      "招商银行": {
          "detail": {
            "美元理财": 22277.15,
            "人民币理财": 20215.59,
            "养老金": 12002.79
          },
          "total": 54495.53
        },
      "网商银行": {
          "detail": {
            "人民币理财": 20012.33
          },
          "total": 20012.33
        },
      "支付宝": {
          "detail": {
            "存款": 0,
            "基金": 10074,
            "养老金": 0
          },
          "total": 10074
        },
      "腾讯自选股": {
          "detail": {
            "股票": 36283.57
          },
          "total": 36283.57
        },
      "grand_total": 287242.41
    }
  },
  {
    date: '2025-04-23',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 90756.71,
            "存款": 5690.4,
            "基金": 30101.12
          },
          "total": 126548.23
        },
      "招商银行": {
          "detail": {
            "美元理财": 22418.04,
            "人民币理财": 20252.5,
            "养老金": 12002.79
          },
          "total": 54673.33
        },
      "网商银行": {
          "detail": {
            "人民币理财": 70045.95,
            "存款": 10
          },
          "total": 70055.95
        },
      "支付宝": {
          "detail": {
            "存款": 5098.39,
            "基金": 17574.36,
            "养老金": 3089
          },
          "total": 25761.75
        },
      "腾讯自选股": {
          "detail": {
            "股票": 26713.96
          },
          "total": 26713.96
        },
      "grand_total": 303753.22
    }
  },
  {
    date: '2025-04-24',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 90779.09,
            "存款": 5586.6,
            "基金": 30102.34
          },
          "total": 126468.03
        },
      "招商银行": {
          "detail": {
            "美元理财": 22438.52,
            "人民币理财": 20252.5,
            "养老金": 12002.79
          },
          "total": 54693.81
        },
      "网商银行": {
          "detail": {
            "人民币理财": 70050.14
          },
          "total": 70050.14
        },
      "支付宝": {
          "detail": {
            "存款": 5098.39,
            "基金": 17789.02,
            "养老金": 3090
          },
          "total": 25977.41
        },
      "腾讯自选股": {
          "detail": {
            "股票": 26830.39
          },
          "total": 26830.39
        },
      "grand_total": 304019.78
    }
  },
  {
    date: '2025-04-25',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 90793.63,
            "存款": 5476.6,
            "基金": 30103.56
          },
          "total": 126373.79
        },
      "招商银行": {
          "detail": {
            "美元理财": 22454.43,
            "人民币理财": 20252.5,
            "养老金": 12002.79
          },
          "total": 54709.72
        },
      "网商银行": {
          "detail": {
            "人民币理财": 70054.22
          },
          "total": 70054.22
        },
      "支付宝": {
          "detail": {
            "存款": 5098.6,
            "基金": 17959.22,
            "养老金": 3100
          },
          "total": 26157.82
        },
      "腾讯自选股": {
          "detail": {
            "股票": 26909.46
          },
          "total": 26909.46
        },
      "grand_total": 304205.01
    }
  },
  {
    date: '2025-04-27',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 90764.94,
            "存款": 5230.22,
            "基金": 30103.56
          },
          "total": 126098.72
        },
      "招商银行": {
          "detail": {
            "美元理财": 22421.74,
            "人民币理财": 20252.5,
            "养老金": 12002.79
          },
          "total": 54677.03
        },
      "网商银行": {
          "detail": {
            "人民币理财": 70054.22
          },
          "total": 70054.22
        },
      "支付宝": {
          "detail": {
            "存款": 5098.85,
            "基金": 17959.22,
            "养老金": 3100
          },
          "total": 26158.07
        },
      "腾讯自选股": {
          "detail": {
            "股票": 26909.46
          },
          "total": 26909.46
        },
      "grand_total": 303897.5
    }
  },
  {
    date: '2025-04-28',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 90881.44,
            "存款": 5221.52,
            "基金": 30107.24
          },
          "total": 126210.2
        },
      "招商银行": {
          "detail": {
            "美元理财": 22463.75,
            "人民币理财": 20254.44,
            "养老金": 12002.79
          },
          "total": 54720.98
        },
      "网商银行": {
          "detail": {
            "人民币理财": 70057.47
          },
          "total": 70057.47
        },
      "支付宝": {
          "detail": {
            "存款": 5099.27,
            "基金": 18065.05,
            "养老金": 3100
          },
          "total": 26264.32
        },
      "腾讯自选股": {
          "detail": {
            "股票": 27105.01
          },
          "total": 27105.01
        },
      "grand_total": 304357.98
    }
  },
  {
    date: '2025-05-01',
    data: {
      "工商银行": {
          "detail": {
            "美元理财": 90639.06,
            "存款": 4570.47,
            "基金": 30109.67
          },
          "total": 125319.2
        },
      "招商银行": {
          "detail": {
            "美元理财": 22363.01,
            "人民币理财": 20258.32,
            "养老金": 12002.79
          },
          "total": 54624.12
        },
      "网商银行": {
          "detail": {
            "人民币理财": 70073.42
          },
          "total": 70073.42
        },
      "支付宝": {
          "detail": {
            "存款": 5100.36,
            "基金": 17953.61,
            "养老金": 3100
          },
          "total": 26153.97
        },
      "腾讯自选股": {
          "detail": {
            "股票": 26912.33
          },
          "total": 26912.33
        },
      "grand_total": 303083.04
    }
  }
];

// 可选：保留原有的随机生成逻辑（如果需要）
// undefined
